STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp253axx_ca35.h
/** @addtogroup Peripheral_registers_structures
  * @{
  */

  /**
    * @brief Analog to Digital Converter (ADC)
    */
  typedef struct
  {
    __IO uint32_t ISR;           /*!< ADC interrupt and status register,                     Address offset: 0x00 */
    __IO uint32_t IER;           /*!< ADC interrupt enable register,                         Address offset: 0x04 */
    __IO uint32_t CR;            /*!< ADC control register,                                  Address offset: 0x08 */
    __IO uint32_t CFGR1;         /*!< ADC configuration register 1,                          Address offset: 0x0C */
    __IO uint32_t CFGR2;         /*!< ADC configuration register 2,                          Address offset: 0x10 */
    __IO uint32_t SMPR1;         /*!< ADC sample time register 1,                            Address offset: 0x14 */
    __IO uint32_t SMPR2;         /*!< ADC sample time register 2,                            Address offset: 0x18 */
    __IO uint32_t PCSEL;         /*!< ADC channel preselection register,                     Address offset: 0x1C */
    uint32_t      RESERVED1[4];  /*!< Reserved,                                              Address offset: 0x020-0x02C */
    __IO uint32_t SQR1;          /*!< ADC regular sequence register 1,                       Address offset: 0x30 */
    __IO uint32_t SQR2;          /*!< ADC regular sequence register 2,                       Address offset: 0x34 */
    __IO uint32_t SQR3;          /*!< ADC regular sequence register 3,                       Address offset: 0x38 */
    __IO uint32_t SQR4;          /*!< ADC regular sequence register 4,                       Address offset: 0x3C */
    __IO uint32_t DR;            /*!< ADC regular data register,                             Address offset: 0x40 */
    uint32_t      RESERVED2[2];  /*!< Reserved,                                              Address offset: 0x044-0x048 */
    __IO uint32_t JSQR;          /*!< ADC injected sequence register,                        Address offset: 0x4C */
    __IO uint32_t OFCFGR1;       /*!< ADC offset configuration register 1,                   Address offset: 0x50 */
    __IO uint32_t OFCFGR2;       /*!< ADC offset configuration register 2,                   Address offset: 0x54 */
    __IO uint32_t OFCFGR3;       /*!< ADC offset configuration register 3,                   Address offset: 0x58 */
    __IO uint32_t OFCFGR4;       /*!< ADC offset configuration register 4,                   Address offset: 0x5C */
    __IO uint32_t OFR1;          /*!< ADC offset register 1,                                 Address offset: 0x60 */
    __IO uint32_t OFR2;          /*!< ADC offset register 2,                                 Address offset: 0x64 */
    __IO uint32_t OFR3;          /*!< ADC offset register 3,                                 Address offset: 0x68 */
    __IO uint32_t OFR4;          /*!< ADC offset register 4,                                 Address offset: 0x6C */
    __IO uint32_t GCOMP;         /*!< ADC gain compensation register,                        Address offset: 0x70 */
    uint32_t      RESERVED3[3];  /*!< Reserved,                                              Address offset: 0x074-0x07C */
    __IO uint32_t JDR1;          /*!< ADC injected data register 1,                          Address offset: 0x80 */
    __IO uint32_t JDR2;          /*!< ADC injected data register 2,                          Address offset: 0x84 */
    __IO uint32_t JDR3;          /*!< ADC injected data register 3,                          Address offset: 0x88 */
    __IO uint32_t JDR4;          /*!< ADC injected data register 4,                          Address offset: 0x8C */
    uint32_t      RESERVED4[4];  /*!< Reserved,                                              Address offset: 0x090-0x09C */
    __IO uint32_t AWD2CR;        /*!< ADC analog watchdog 2 configuration register,          Address offset: 0xA0 */
    __IO uint32_t AWD3CR;        /*!< ADC analog watchdog 3 configuration register,          Address offset: 0xA4 */
    __IO uint32_t AWD1LTR;       /*!< ADC analog watchdog 1 low threshold register,          Address offset: 0xA8 */
    __IO uint32_t AWD1HTR;       /*!< ADC analog watchdog 1 high threshold register,         Address offset: 0xAC */
    __IO uint32_t AWD2LTR;       /*!< ADC analog watchdog 2 low threshold register,          Address offset: 0xB0 */
    __IO uint32_t AWD2HTR;       /*!< ADC analog watchdog 2 high threshold register,         Address offset: 0xB4 */
    __IO uint32_t AWD3LTR;       /*!< ADC analog watchdog 3 low threshold register,          Address offset: 0xB8 */
    __IO uint32_t AWD3HTR;       /*!< ADC analog watchdog 3 high threshold register,         Address offset: 0xBC */
    __IO uint32_t DIFSEL;        /*!< ADC differential mode selection register,              Address offset: 0xC0 */
    __IO uint32_t CALFACT;       /*!< ADC calibration factors,                               Address offset: 0xC4 */
    uint32_t      RESERVED5[2];  /*!< Reserved,                                              Address offset: 0x0C8-0x0CC */
    __IO uint32_t OR;            /*!< ADC option register,                                   Address offset: 0xD0 */
  } ADC_TypeDef;

  typedef struct
  {
    __IO uint32_t CSR;           /*!< ADC common status register,                            Address offset: 0x300 */
    uint32_t RESERVED;           /*!< Reserved,                                              Address offset: 0x304 */
    __IO uint32_t CCR;           /*!< ADC common control register,                           Address offset: 0x308 */
    uint32_t RESERVED0[57];      /*!< Reserved                                               Address offset: 0x30C-0x3EC */
    __IO uint32_t HWCFGR1;       /*!< ADC hardware configuration register                    Address offset: 0x3F0 */
    __IO uint32_t VERR;          /*!< CRC version register,                                  Address offset: 0x3F4 */
    __IO uint32_t IPIDR;         /*!< CRC ID register,                                       Address offset: 0x3F8 */
    __IO uint32_t SIDR;          /*!< CRC Size ID register,                                  Address offset: 0x3FC */
  } ADC_Common_TypeDef;
/*
 * @brief BSEC unit (BSEC)
 */
typedef struct
{
  __IO uint32_t FVRw[384];       /*!< BSEC fuse word (0-383) value register    Address offset: 0x000-0x5FC */
       uint32_t RESERVED0[128];  /*!< Reserved                                 Address offset: 0x600-0x7FC */
  __IO uint32_t SPLOCKx[12];     /*!< BSEC sticky program lock register (0-11), */ 
       uint32_t RESERVED1[4];    /*!< Reserved                                 Address offset: 0x830-0x83C */
  __IO uint32_t SWLOCKx[12];     /*!< BSEC sticky write lock register (0-11),      Address offset: 0x840-0x86C */
       uint32_t RESERVED2[4];    /*!< Reserved                                 Address offset: 0x870-0x87C */
  __IO uint32_t SRLOCKx[12];     /*!< BSEC sticky reload lock register (0-11),     Address offset: 0x880-0x8AC */
       uint32_t RESERVED3[4];    /*!< Reserved                                 Address offset: 0x8B0-0x8BC */
  __IO uint32_t OTPVLDRx[12];    /*!< BSEC OTP valid register (0-11),              Address offset: 0x8C0-0x8EC */
       uint32_t RESERVED4[20];   /*!< Reserved                                 Address offset: 0x8F0-0x93C */
  __IO uint32_t SFSRx[12];       /*!< BSEC shadowed fuses status register (0-11),  Address offset: 0x940-0x96C */
       uint32_t RESERVED5[165];  /*!< Reserved                                 Address offset: 0x970-0xC00 */
  __IO uint32_t OTPCR;           /*!< BSEC OTP control register                Address offset: 0xC04 */
  __IO uint32_t WDR;             /*!< BSEC write data register                 Address offset: 0xC08 */
       uint32_t RESERVED6[125];  /*!< Reserved                                 Address offset: 0xC0C-0xDFC */
  __IO uint32_t SCRATCHRx[4];    /*!< BSEC scratch register (0-3),                 Address offset: 0xE00-0xE0C */
  __IO uint32_t LOCKR;           /*!< BSEC lock register                       Address offset: 0xE10 */
  __IO uint32_t JTAGINR;         /*!< BSEC JTAG input register                 Address offset: 0xE14 */
  __IO uint32_t JTAGOUTR;        /*!< BSEC JTAG output register                Address offset: 0xE18 */
       uint32_t RESERVED7;       /*!< Reserved                                 Address offset: 0xE1C */
  __IO uint32_t DENR;            /*!< BSEC debug enable register               Address offset: 0xE20 */
  __IO uint32_t UNMAPR;          /*!< BSEC unmap register                      Address offset: 0xE24 */
       uint32_t RESERVED8[6];    /*!< Reserved                                 Address offset: 0xE28-0xE3C */
  __IO uint32_t SR;              /*!< BSEC status register                     Address offset: 0xE40 */
  __IO uint32_t OTPSR;           /*!< BSEC OTP status register                 Address offset: 0xE44 */
	   uint32_t RESERVED9[62];   /*!< Reserved                                 Address offset: 0xE48-0xF3C */
  __IO uint32_t WOSCRx[8];       /*!< BSEC write once scratch register (0-7),      Address offset: 0xF40-0xF5C */
       uint32_t RESERVED10[34];  /*!< Reserved                                 Address offset: 0xF60-0xFE4 */
  __IO uint32_t HRCR;            /*!< BSEC hot reset count register            Address offset: 0xFE8 */
  __IO uint32_t WRCR;            /*!< BSEC warm reset count register           Address offset: 0xFEC */
       uint32_t RESERVED11;      /*!< Reserved                                 Address offset: 0xFF0 */	
  __IO uint32_t VERR;            /*!< BSEC version register                    Address offset: 0xFF4 */
  __IO uint32_t IPIDR;           /*!< BSEC identification register             Address offset: 0xFF8 */
  __IO uint32_t SIDR;            /*!< BSEC size identification register        Address offset: 0xFFC */
} BSEC_TypeDef;

/**
  * @brief CA35 Standardized status and control (SSC) registers
  */

typedef struct
{
  __IO uint32_t CHGCLKREQ_RW;           /*!< CA35SS SSC CHGCLKREQ register                    Address offset: 0x0000 */
  __IO uint32_t CHGCLKREQ_WS1;          /*!< CA35SS SSC CHGCLKREQ register                    Address offset: 0x0004 */
  __IO uint32_t CHGCLKREQ_WC1;          /*!< CA35SS SSC CHGCLKREQ register                    Address offset: 0x0008 */
  __IO uint32_t CHGCLKREQ_WT1;          /*!< CA35SS SSC CHGCLKREQ register                    Address offset: 0x000C */
  __IO uint32_t BRM_RW;                 /*!< CA35SS SSC BRM register                          Address offset: 0x0010 */
  __IO uint32_t BRM_WS1;                /*!< CA35SS SSC BRM register                          Address offset: 0x0014 */
  __IO uint32_t BRM_WC1;                /*!< CA35SS SSC BRM register                          Address offset: 0x0018 */
  __IO uint32_t BRM_WT1;                /*!< CA35SS SSC BRM register                          Address offset: 0x001C */
       uint32_t RESERVED0[24];          /*!< Reserved                                         Address offset: 0x0020-0x007C */
  __IO uint32_t PLL_FREQ1_RW;           /*!< CA35SS SSC PLL FREQ1 register                    Address offset: 0x0080 */
  __IO uint32_t PLL_FREQ1_WS1;          /*!< CA35SS SSC PLL FREQ1 register                    Address offset: 0x0084 */
  __IO uint32_t PLL_FREQ1_WC1;          /*!< CA35SS SSC PLL FREQ1 register                    Address offset: 0x0088 */
  __IO uint32_t PLL_FREQ1_WT1;          /*!< CA35SS SSC PLL FREQ1 register                    Address offset: 0x008C */
  __IO uint32_t PLL_FREQ2_RW;           /*!< CA35SS SSC PLL FREQ2 register                    Address offset: 0x0090 */
  __IO uint32_t PLL_FREQ2_WS1;          /*!< CA35SS SSC PLL FREQ2 register                    Address offset: 0x0094 */
  __IO uint32_t PLL_FREQ2_WC1;          /*!< CA35SS SSC PLL FREQ2 register                    Address offset: 0x0098 */
  __IO uint32_t PLL_FREQ2_WT1;          /*!< CA35SS SSC PLL FREQ2 register                    Address offset: 0x009C */
  __IO uint32_t PLL_ENABLE_RW;          /*!< CA35SS SSC PLL enable register                   Address offset: 0x00A0 */
  __IO uint32_t PLL_ENABLE_WS1;         /*!< CA35SS SSC PLL enable register                   Address offset: 0x00A4 */
  __IO uint32_t PLL_ENABLE_WC1;         /*!< CA35SS SSC PLL enable register                   Address offset: 0x00A8 */
  __IO uint32_t PLL_ENABLE_WT1;         /*!< CA35SS SSC PLL enable register                   Address offset: 0x00AC */
       uint32_t RESERVED1[8];           /*!< Reserved                                         Address offset: 0x00B0-0x00CC */
  __IO uint32_t LPI_TSGEN_NTS_CR_RW;    /*!< CA35SS SSC LPI TSGEN NTS CR register             Address offset: 0x00D0 */
  __IO uint32_t LPI_TSGEN_NTS_CR_WS1;   /*!< CA35SS SSC LPI TSGEN NTS CR register             Address offset: 0x00D4 */
  __IO uint32_t LPI_TSGEN_NTS_CR_WC1;   /*!< CA35SS SSC LPI TSGEN NTS CR register             Address offset: 0x00D8 */
  __IO uint32_t LPI_TSGEN_NTS_CR_WT1;   /*!< CA35SS SSC LPI TSGEN NTS CR register             Address offset: 0x00DC */
       uint32_t RESERVED2[8];           /*!< Reserved                                         Address offset: 0x00E0-0x00FC */
  __IO uint32_t CORE0_SMP;              /*!< CA35SS SSC core 0 SMP register                   Address offset: 0x0100 */
       uint32_t RESERVED3[3];           /*!< Reserved                                         Address offset: 0x0104-0x010C */
  __IO uint32_t CORE1_SMP;              /*!< CA35SS SSC core 1 SMP register                   Address offset: 0x0110 */
       uint32_t RESERVED4[11];          /*!< Reserved                                         Address offset: 0x0114-0x013C */
  __IO uint32_t LPI_STGEN_NTS_CR_RW;    /*!< CA35SS SSC LPI STGEN NTS CR register             Address offset: 0x0140 */
  __IO uint32_t LPI_STGEN_NTS_CR_WS1;   /*!< CA35SS SSC LPI STGEN NTS CR register             Address offset: 0x0144 */
  __IO uint32_t LPI_STGEN_NTS_CR_WC1;   /*!< CA35SS SSC LPI STGEN NTS CR register             Address offset: 0x0148 */
  __IO uint32_t LPI_STGEN_NTS_CR_WT1;   /*!< CA35SS SSC LPI STGEN NTS CR register             Address offset: 0x014C */
       uint32_t RESERVED5[41];          /*!< Reserved                                         Address offset: 0x0150-0x01F0 */
  __IO uint32_t VERR;                   /*!< CA35SS SYSCFG version register                   Address offset: 0x01F4 */
  __IO uint32_t IPIDR;                  /*!< CA35SS SYSCFG identification register            Address offset: 0x01F8 */
  __IO uint32_t SIDR;                   /*!< CA35SS SYSCFG size register                      Address offset: 0x01FC */
  __IO uint32_t NS_ENABLE_0_RW;         /*!< CA35SS SSC NS enable 0 register                  Address offset: 0x03C0 */
  __IO uint32_t NS_ENABLE_0_WS1;        /*!< CA35SS SSC NS enable 0 register                  Address offset: 0x03C4 */
  __IO uint32_t NS_ENABLE_0_WC1;        /*!< CA35SS SSC NS enable 0 register                  Address offset: 0x03C8 */
  __IO uint32_t NS_ENABLE_0_WT1;        /*!< CA35SS SSC NS enable 0 register                  Address offset: 0x03CC */
  __IO uint32_t NS_ENABLE_1;            /*!< CA35SS SSC NS enable 1 register                  Address offset: 0x03D0 */
} CA35SSC_TypeDef;

/**
  * @brief CA35 System configuration (SYSCFG) registers
  */

typedef struct
{
  __IO uint32_t ETR_LPI_CR;          /*!< CA35SS ETR low-power interface control register  Address offset: 0x00 */
  __IO uint32_t ETR_LPI_SR;          /*!< CA35SS ETR low-power interface status register   Address offset: 0x04 */
  __IO uint32_t STM_NSGUAREN_CR;     /*!< CA35SS STM non-secure guaranteed access register Address offset: 0x08 */
  __IO uint32_t TRACE_CLK_DIV_CR;    /*!< CA35SS TPIU export clock divider register        Address offset: 0x0C */
  __IO uint32_t DBGPWR_CR;           /*!< CA35SS Cortex-A35 core debug power mode register Address offset: 0x10 */
  __IO uint32_t DBGL1RSTDISABLE_CR;  /*!< CA35SS Cortex-A35 L1 data cache register         Address offset: 0x14 */
  __IO uint32_t DBGPWR_SR;           /*!< CA35SS Cortex-A35 debug power register           Address offset: 0x18 */
  __IO uint32_t EDBGACK_SR;          /*!< CA35SS Cortex-A35 debug mode status register     Address offset: 0x1C */
  __IO uint32_t GIC_CFGR;            /*!< GIC configuration register                       Address offset: 0x20 */
  __IO uint32_t LP_SR;               /*!< Cortex-A35 low-power status register             Address offset: 0x24 */
  __IO uint32_t RSTACK_SR;           /*!< Cortex-A35 reset status register                 Address offset: 0x28 */
       uint32_t RESERVED0[21];       /*!< Reserved                                         Address offset: 0x2C-0x7C */
  __IO uint32_t AARCH_MODE_CR;       /*!< CA35SS architecture mode register                Address offset: 0x80 */
  __IO uint32_t VBAR_CR;             /*!< CA35SS 64-bit mode reset vector register         Address offset: 0x84 */
  __IO uint32_t M33_ACCESS_CR;       /*!< Cortex-M33 boot register access rights register  Address offset: 0x88 */
       uint32_t RESERVED1[5];        /*!< Reserved                                         Address offset: 0x8C-0x9C */
  __IO uint32_t M33_TZEN_CR;         /*!< Cortex-M33 secure extension enable register      Address offset: 0xA0 */
  __IO uint32_t M33_INITSVTOR_CR;    /*!< Cortex-M33 secure vector address register        Address offset: 0xA4 */
  __IO uint32_t M33_INITNSVTOR_CR;   /*!< Cortex-M33 non-secure vector address register    Address offset: 0xA8 */
       uint32_t RESERVED2[82];       /*!< Reserved                                         Address offset: 0xAC-0x1F0 */
  __IO uint32_t VERR;                /*!< CA35SS version register,                         Address offset: 0x1F4 */
  __IO uint32_t IPIDR;               /*!< CA35SS ID register,                              Address offset: 0x1F8 */
  __IO uint32_t SIDR;                /*!< CA35SS Size ID register,                         Address offset: 0x1FC */
} CA35SYSCFG_TypeDef;

/**
  * @brief CRC calculation unit
  */

typedef struct
{
  __IO uint32_t DR;          /*!< CRC Data register,                           Address offset: 0x000 */
  __IO uint32_t IDR;         /*!< CRC Independent data register,               Address offset: 0x004 */
  __IO uint32_t CR;          /*!< CRC Control register,                        Address offset: 0x008 */
  uint32_t      RESERVED2;   /*!< Reserved,                                                    0x00C */
  __IO uint32_t INIT;        /*!< Initial CRC value register,                  Address offset: 0x010 */
  __IO uint32_t POL;         /*!< CRC polynomial register,                     Address offset: 0x014 */
  uint32_t      RESERVED3[247];   /*!< Reserved,                                       0x018 - 0x3F0 */
  __IO uint32_t VERR;        /*!< CRC version register,                        Address offset: 0x3F4 */
  __IO uint32_t IPIDR;       /*!< CRC ID register,                             Address offset: 0x3F8 */
  __IO uint32_t SIDR;        /*!< CRC Size ID register,                        Address offset: 0x3FC */
} CRC_TypeDef;

