STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp253axx_ca35.h
/* Bit fields for RCC_RDCR register */
#define RCC_RDCR_MRD_Pos                             (16U)
#define RCC_RDCR_MRD_Msk                             (0x1FUL << RCC_RDCR_MRD_Pos)                           /*!< 0x001F0000 */
#define RCC_RDCR_MRD                                 RCC_RDCR_MRD_Msk                                      /*!< Minimum reset duration */
#define RCC_RDCR_EADLY_Pos                           (24U)
#define RCC_RDCR_EADLY_Msk                           (0xFUL << RCC_RDCR_EADLY_Pos)                          /*!< 0x0F000000 */
#define RCC_RDCR_EADLY                               RCC_RDCR_EADLY_Msk                                    /*!< External access delays */

/* Bit fields for RCC_C1MSRDCR register */
#define RCC_C1MSRDCR_C1MSRD_Pos                      (0U)
#define RCC_C1MSRDCR_C1MSRD_Msk                      (0x1FUL << RCC_C1MSRDCR_C1MSRD_Pos)                    /*!< 0x0000001F */
#define RCC_C1MSRDCR_C1MSRD                          RCC_C1MSRDCR_C1MSRD_Msk                               /*!< Minimum Standby reset duration */
#define RCC_C1MSRDCR_C1MSRST_Pos                     (8U)
#define RCC_C1MSRDCR_C1MSRST_Msk                     (0x1UL << RCC_C1MSRDCR_C1MSRST_Pos)                    /*!< 0x00000100 */
#define RCC_C1MSRDCR_C1MSRST                         RCC_C1MSRDCR_C1MSRST_Msk                              /*!< Trigger low-level pulse on NRSTC1MS pin */

/* Bit fields for RCC_PWRLPDLYCR register */
#define RCC_PWRLPDLYCR_PWRLP_DLY_Pos                 (0U)
#define RCC_PWRLPDLYCR_PWRLP_DLY_Msk                 (0x3FFFFFUL << RCC_PWRLPDLYCR_PWRLP_DLY_Pos)           /*!< 0x003FFFFF */
#define RCC_PWRLPDLYCR_PWRLP_DLY                     RCC_PWRLPDLYCR_PWRLP_DLY_Msk                          /*!< PWR_LP delay value */
#define RCC_PWRLPDLYCR_CPU2TMPSKP_Pos                (24U)
#define RCC_PWRLPDLYCR_CPU2TMPSKP_Msk                (0x1UL << RCC_PWRLPDLYCR_CPU2TMPSKP_Pos)               /*!< 0x01000000 */
#define RCC_PWRLPDLYCR_CPU2TMPSKP                    RCC_PWRLPDLYCR_CPU2TMPSKP_Msk                         /*!< Skip of PWR_LP delay for CPU2 */

/* Bit fields for RCC_C1CIESETR register */
#define RCC_C1CIESETR_LSIRDYIE_Pos                   (0U)
#define RCC_C1CIESETR_LSIRDYIE_Msk                   (0x1UL << RCC_C1CIESETR_LSIRDYIE_Pos)                  /*!< 0x00000001 */
#define RCC_C1CIESETR_LSIRDYIE                       RCC_C1CIESETR_LSIRDYIE_Msk                            /*!< LSI ready interrupt enable */
#define RCC_C1CIESETR_LSERDYIE_Pos                   (1U)
#define RCC_C1CIESETR_LSERDYIE_Msk                   (0x1UL << RCC_C1CIESETR_LSERDYIE_Pos)                  /*!< 0x00000002 */
#define RCC_C1CIESETR_LSERDYIE                       RCC_C1CIESETR_LSERDYIE_Msk                            /*!< LSE ready interrupt enable */
#define RCC_C1CIESETR_HSIRDYIE_Pos                   (2U)
#define RCC_C1CIESETR_HSIRDYIE_Msk                   (0x1UL << RCC_C1CIESETR_HSIRDYIE_Pos)                  /*!< 0x00000004 */
#define RCC_C1CIESETR_HSIRDYIE                       RCC_C1CIESETR_HSIRDYIE_Msk                            /*!< HSI ready interrupt enable */
#define RCC_C1CIESETR_HSERDYIE_Pos                   (3U)
#define RCC_C1CIESETR_HSERDYIE_Msk                   (0x1UL << RCC_C1CIESETR_HSERDYIE_Pos)                  /*!< 0x00000008 */
#define RCC_C1CIESETR_HSERDYIE                       RCC_C1CIESETR_HSERDYIE_Msk                            /*!< HSE ready interrupt enable */
#define RCC_C1CIESETR_MSIRDYIE_Pos                   (4U)
#define RCC_C1CIESETR_MSIRDYIE_Msk                   (0x1UL << RCC_C1CIESETR_MSIRDYIE_Pos)                  /*!< 0x00000010 */
#define RCC_C1CIESETR_MSIRDYIE                       RCC_C1CIESETR_MSIRDYIE_Msk                            /*!< MSI ready interrupt enable */
#define RCC_C1CIESETR_PLL1RDYIE_Pos                  (5U)
#define RCC_C1CIESETR_PLL1RDYIE_Msk                  (0x1UL << RCC_C1CIESETR_PLL1RDYIE_Pos)                 /*!< 0x00000020 */
#define RCC_C1CIESETR_PLL1RDYIE                      RCC_C1CIESETR_PLL1RDYIE_Msk                           /*!< PLL1 ready interrupt enable */
#define RCC_C1CIESETR_PLL2RDYIE_Pos                  (6U)
#define RCC_C1CIESETR_PLL2RDYIE_Msk                  (0x1UL << RCC_C1CIESETR_PLL2RDYIE_Pos)                 /*!< 0x00000040 */
#define RCC_C1CIESETR_PLL2RDYIE                      RCC_C1CIESETR_PLL2RDYIE_Msk                           /*!< PLL2 ready interrupt enable */
#define RCC_C1CIESETR_PLL3RDYIE_Pos                  (7U)
#define RCC_C1CIESETR_PLL3RDYIE_Msk                  (0x1UL << RCC_C1CIESETR_PLL3RDYIE_Pos)                 /*!< 0x00000080 */
#define RCC_C1CIESETR_PLL3RDYIE                      RCC_C1CIESETR_PLL3RDYIE_Msk                           /*!< PLL3 ready interrupt enable */
#define RCC_C1CIESETR_PLL4RDYIE_Pos                  (8U)
#define RCC_C1CIESETR_PLL4RDYIE_Msk                  (0x1UL << RCC_C1CIESETR_PLL4RDYIE_Pos)                 /*!< 0x00000100 */
#define RCC_C1CIESETR_PLL4RDYIE                      RCC_C1CIESETR_PLL4RDYIE_Msk                           /*!< PLL4 ready interrupt enable */
#define RCC_C1CIESETR_PLL5RDYIE_Pos                  (9U)
#define RCC_C1CIESETR_PLL5RDYIE_Msk                  (0x1UL << RCC_C1CIESETR_PLL5RDYIE_Pos)                 /*!< 0x00000200 */
#define RCC_C1CIESETR_PLL5RDYIE                      RCC_C1CIESETR_PLL5RDYIE_Msk                           /*!< PLL5 ready interrupt enable */
#define RCC_C1CIESETR_PLL6RDYIE_Pos                  (10U)
#define RCC_C1CIESETR_PLL6RDYIE_Msk                  (0x1UL << RCC_C1CIESETR_PLL6RDYIE_Pos)                 /*!< 0x00000400 */
#define RCC_C1CIESETR_PLL6RDYIE                      RCC_C1CIESETR_PLL6RDYIE_Msk                           /*!< PLL6 ready interrupt enable */
#define RCC_C1CIESETR_PLL7RDYIE_Pos                  (11U)
#define RCC_C1CIESETR_PLL7RDYIE_Msk                  (0x1UL << RCC_C1CIESETR_PLL7RDYIE_Pos)                 /*!< 0x00000800 */
#define RCC_C1CIESETR_PLL7RDYIE                      RCC_C1CIESETR_PLL7RDYIE_Msk                           /*!< PLL7 ready interrupt enable */
#define RCC_C1CIESETR_PLL8RDYIE_Pos                  (12U)
#define RCC_C1CIESETR_PLL8RDYIE_Msk                  (0x1UL << RCC_C1CIESETR_PLL8RDYIE_Pos)                 /*!< 0x00001000 */
#define RCC_C1CIESETR_PLL8RDYIE                      RCC_C1CIESETR_PLL8RDYIE_Msk                           /*!< PLL8 ready interrupt enable */
#define RCC_C1CIESETR_LSECSSIE_Pos                   (16U)
#define RCC_C1CIESETR_LSECSSIE_Msk                   (0x1UL << RCC_C1CIESETR_LSECSSIE_Pos)                  /*!< 0x00010000 */
#define RCC_C1CIESETR_LSECSSIE                       RCC_C1CIESETR_LSECSSIE_Msk                            /*!< LSE clock security system interrupt enable */
#define RCC_C1CIESETR_WKUPIE_Pos                     (20U)
#define RCC_C1CIESETR_WKUPIE_Msk                     (0x1UL << RCC_C1CIESETR_WKUPIE_Pos)                    /*!< 0x00100000 */
#define RCC_C1CIESETR_WKUPIE                         RCC_C1CIESETR_WKUPIE_Msk                              /*!< CPU1 wake-up from CStop interrupt enable */

/* Bit fields for RCC_C1CIFCLRR register */
#define RCC_C1CIFCLRR_LSIRDYF_Pos                    (0U)
#define RCC_C1CIFCLRR_LSIRDYF_Msk                    (0x1UL << RCC_C1CIFCLRR_LSIRDYF_Pos)                   /*!< 0x00000001 */
#define RCC_C1CIFCLRR_LSIRDYF                        RCC_C1CIFCLRR_LSIRDYF_Msk                             /*!< LSI ready interrupt flag */
#define RCC_C1CIFCLRR_LSERDYF_Pos                    (1U)
#define RCC_C1CIFCLRR_LSERDYF_Msk                    (0x1UL << RCC_C1CIFCLRR_LSERDYF_Pos)                   /*!< 0x00000002 */
#define RCC_C1CIFCLRR_LSERDYF                        RCC_C1CIFCLRR_LSERDYF_Msk                             /*!< LSE ready interrupt flag */
#define RCC_C1CIFCLRR_HSIRDYF_Pos                    (2U)
#define RCC_C1CIFCLRR_HSIRDYF_Msk                    (0x1UL << RCC_C1CIFCLRR_HSIRDYF_Pos)                   /*!< 0x00000004 */
#define RCC_C1CIFCLRR_HSIRDYF                        RCC_C1CIFCLRR_HSIRDYF_Msk                             /*!< HSI ready interrupt flag */
#define RCC_C1CIFCLRR_HSERDYF_Pos                    (3U)
#define RCC_C1CIFCLRR_HSERDYF_Msk                    (0x1UL << RCC_C1CIFCLRR_HSERDYF_Pos)                   /*!< 0x00000008 */
#define RCC_C1CIFCLRR_HSERDYF                        RCC_C1CIFCLRR_HSERDYF_Msk                             /*!< HSE ready interrupt flag */
#define RCC_C1CIFCLRR_MSIRDYF_Pos                    (4U)
#define RCC_C1CIFCLRR_MSIRDYF_Msk                    (0x1UL << RCC_C1CIFCLRR_MSIRDYF_Pos)                   /*!< 0x00000010 */
#define RCC_C1CIFCLRR_MSIRDYF                        RCC_C1CIFCLRR_MSIRDYF_Msk                             /*!< MSI ready interrupt flag */
#define RCC_C1CIFCLRR_PLL1RDYF_Pos                   (5U)
#define RCC_C1CIFCLRR_PLL1RDYF_Msk                   (0x1UL << RCC_C1CIFCLRR_PLL1RDYF_Pos)                  /*!< 0x00000020 */
#define RCC_C1CIFCLRR_PLL1RDYF                       RCC_C1CIFCLRR_PLL1RDYF_Msk                            /*!< PLL1 ready interrupt flag */
#define RCC_C1CIFCLRR_PLL2RDYF_Pos                   (6U)
#define RCC_C1CIFCLRR_PLL2RDYF_Msk                   (0x1UL << RCC_C1CIFCLRR_PLL2RDYF_Pos)                  /*!< 0x00000040 */
#define RCC_C1CIFCLRR_PLL2RDYF                       RCC_C1CIFCLRR_PLL2RDYF_Msk                            /*!< PLL2 ready interrupt flag */
#define RCC_C1CIFCLRR_PLL3RDYF_Pos                   (7U)
#define RCC_C1CIFCLRR_PLL3RDYF_Msk                   (0x1UL << RCC_C1CIFCLRR_PLL3RDYF_Pos)                  /*!< 0x00000080 */
#define RCC_C1CIFCLRR_PLL3RDYF                       RCC_C1CIFCLRR_PLL3RDYF_Msk                            /*!< PLL3 ready interrupt flag */
#define RCC_C1CIFCLRR_PLL4RDYF_Pos                   (8U)
#define RCC_C1CIFCLRR_PLL4RDYF_Msk                   (0x1UL << RCC_C1CIFCLRR_PLL4RDYF_Pos)                  /*!< 0x00000100 */
#define RCC_C1CIFCLRR_PLL4RDYF                       RCC_C1CIFCLRR_PLL4RDYF_Msk                            /*!< PLL4 ready interrupt flag */
#define RCC_C1CIFCLRR_PLL5RDYF_Pos                   (9U)
#define RCC_C1CIFCLRR_PLL5RDYF_Msk                   (0x1UL << RCC_C1CIFCLRR_PLL5RDYF_Pos)                  /*!< 0x00000200 */
#define RCC_C1CIFCLRR_PLL5RDYF                       RCC_C1CIFCLRR_PLL5RDYF_Msk                            /*!< PLL5 ready interrupt flag */
#define RCC_C1CIFCLRR_PLL6RDYF_Pos                   (10U)
#define RCC_C1CIFCLRR_PLL6RDYF_Msk                   (0x1UL << RCC_C1CIFCLRR_PLL6RDYF_Pos)                  /*!< 0x00000400 */
#define RCC_C1CIFCLRR_PLL6RDYF                       RCC_C1CIFCLRR_PLL6RDYF_Msk                            /*!< PLL6 ready interrupt flag */
#define RCC_C1CIFCLRR_PLL7RDYF_Pos                   (11U)
#define RCC_C1CIFCLRR_PLL7RDYF_Msk                   (0x1UL << RCC_C1CIFCLRR_PLL7RDYF_Pos)                  /*!< 0x00000800 */
#define RCC_C1CIFCLRR_PLL7RDYF                       RCC_C1CIFCLRR_PLL7RDYF_Msk                            /*!< PLL7 ready interrupt flag */
#define RCC_C1CIFCLRR_PLL8RDYF_Pos                   (12U)
#define RCC_C1CIFCLRR_PLL8RDYF_Msk                   (0x1UL << RCC_C1CIFCLRR_PLL8RDYF_Pos)                  /*!< 0x00001000 */
#define RCC_C1CIFCLRR_PLL8RDYF                       RCC_C1CIFCLRR_PLL8RDYF_Msk                            /*!< PLL8 ready interrupt flag */
#define RCC_C1CIFCLRR_LSECSSF_Pos                    (16U)
#define RCC_C1CIFCLRR_LSECSSF_Msk                    (0x1UL << RCC_C1CIFCLRR_LSECSSF_Pos)                   /*!< 0x00010000 */
#define RCC_C1CIFCLRR_LSECSSF                        RCC_C1CIFCLRR_LSECSSF_Msk                             /*!< LSE CSS interrupt flag */
#define RCC_C1CIFCLRR_WKUPF_Pos                      (20U)
#define RCC_C1CIFCLRR_WKUPF_Msk                      (0x1UL << RCC_C1CIFCLRR_WKUPF_Pos)                     /*!< 0x00100000 */
#define RCC_C1CIFCLRR_WKUPF                          RCC_C1CIFCLRR_WKUPF_Msk                               /*!< CPU1 wake-up from CStop interrupt flag */

/* Bit fields for RCC_C2CIESETR register */
#define RCC_C2CIESETR_LSIRDYIE_Pos                   (0U)
#define RCC_C2CIESETR_LSIRDYIE_Msk                   (0x1UL << RCC_C2CIESETR_LSIRDYIE_Pos)                  /*!< 0x00000001 */
#define RCC_C2CIESETR_LSIRDYIE                       RCC_C2CIESETR_LSIRDYIE_Msk                            /*!< LSI ready interrupt enable */
#define RCC_C2CIESETR_LSERDYIE_Pos                   (1U)
#define RCC_C2CIESETR_LSERDYIE_Msk                   (0x1UL << RCC_C2CIESETR_LSERDYIE_Pos)                  /*!< 0x00000002 */
#define RCC_C2CIESETR_LSERDYIE                       RCC_C2CIESETR_LSERDYIE_Msk                            /*!< LSE ready interrupt enable */
#define RCC_C2CIESETR_HSIRDYIE_Pos                   (2U)
#define RCC_C2CIESETR_HSIRDYIE_Msk                   (0x1UL << RCC_C2CIESETR_HSIRDYIE_Pos)                  /*!< 0x00000004 */
#define RCC_C2CIESETR_HSIRDYIE                       RCC_C2CIESETR_HSIRDYIE_Msk                            /*!< HSI ready interrupt enable */
#define RCC_C2CIESETR_HSERDYIE_Pos                   (3U)
#define RCC_C2CIESETR_HSERDYIE_Msk                   (0x1UL << RCC_C2CIESETR_HSERDYIE_Pos)                  /*!< 0x00000008 */
#define RCC_C2CIESETR_HSERDYIE                       RCC_C2CIESETR_HSERDYIE_Msk                            /*!< HSE ready interrupt enable */
#define RCC_C2CIESETR_MSIRDYIE_Pos                   (4U)
#define RCC_C2CIESETR_MSIRDYIE_Msk                   (0x1UL << RCC_C2CIESETR_MSIRDYIE_Pos)                  /*!< 0x00000010 */
#define RCC_C2CIESETR_MSIRDYIE                       RCC_C2CIESETR_MSIRDYIE_Msk                            /*!< MSI ready interrupt enable */
#define RCC_C2CIESETR_PLL1RDYIE_Pos                  (5U)
#define RCC_C2CIESETR_PLL1RDYIE_Msk                  (0x1UL << RCC_C2CIESETR_PLL1RDYIE_Pos)                 /*!< 0x00000020 */
#define RCC_C2CIESETR_PLL1RDYIE                      RCC_C2CIESETR_PLL1RDYIE_Msk                           /*!< PLL1 ready interrupt enable */
#define RCC_C2CIESETR_PLL2RDYIE_Pos                  (6U)
#define RCC_C2CIESETR_PLL2RDYIE_Msk                  (0x1UL << RCC_C2CIESETR_PLL2RDYIE_Pos)                 /*!< 0x00000040 */
#define RCC_C2CIESETR_PLL2RDYIE                      RCC_C2CIESETR_PLL2RDYIE_Msk                           /*!< PLL2 ready interrupt enable */
#define RCC_C2CIESETR_PLL3RDYIE_Pos                  (7U)
#define RCC_C2CIESETR_PLL3RDYIE_Msk                  (0x1UL << RCC_C2CIESETR_PLL3RDYIE_Pos)                 /*!< 0x00000080 */
#define RCC_C2CIESETR_PLL3RDYIE                      RCC_C2CIESETR_PLL3RDYIE_Msk                           /*!< PLL3 ready interrupt enable */
#define RCC_C2CIESETR_PLL4RDYIE_Pos                  (8U)
#define RCC_C2CIESETR_PLL4RDYIE_Msk                  (0x1UL << RCC_C2CIESETR_PLL4RDYIE_Pos)                 /*!< 0x00000100 */
#define RCC_C2CIESETR_PLL4RDYIE                      RCC_C2CIESETR_PLL4RDYIE_Msk                           /*!< PLL4 ready interrupt enable */
#define RCC_C2CIESETR_PLL5RDYIE_Pos                  (9U)
#define RCC_C2CIESETR_PLL5RDYIE_Msk                  (0x1UL << RCC_C2CIESETR_PLL5RDYIE_Pos)                 /*!< 0x00000200 */
#define RCC_C2CIESETR_PLL5RDYIE                      RCC_C2CIESETR_PLL5RDYIE_Msk                           /*!< PLL5 ready interrupt enable */
#define RCC_C2CIESETR_PLL6RDYIE_Pos                  (10U)
#define RCC_C2CIESETR_PLL6RDYIE_Msk                  (0x1UL << RCC_C2CIESETR_PLL6RDYIE_Pos)                 /*!< 0x00000400 */
#define RCC_C2CIESETR_PLL6RDYIE                      RCC_C2CIESETR_PLL6RDYIE_Msk                           /*!< PLL6 ready interrupt enable */
#define RCC_C2CIESETR_PLL7RDYIE_Pos                  (11U)
#define RCC_C2CIESETR_PLL7RDYIE_Msk                  (0x1UL << RCC_C2CIESETR_PLL7RDYIE_Pos)                 /*!< 0x00000800 */
#define RCC_C2CIESETR_PLL7RDYIE                      RCC_C2CIESETR_PLL7RDYIE_Msk                           /*!< PLL7 ready interrupt enable */
#define RCC_C2CIESETR_PLL8RDYIE_Pos                  (12U)
#define RCC_C2CIESETR_PLL8RDYIE_Msk                  (0x1UL << RCC_C2CIESETR_PLL8RDYIE_Pos)                 /*!< 0x00001000 */
#define RCC_C2CIESETR_PLL8RDYIE                      RCC_C2CIESETR_PLL8RDYIE_Msk                           /*!< PLL8 ready interrupt enable */
#define RCC_C2CIESETR_LSECSSIE_Pos                   (16U)
#define RCC_C2CIESETR_LSECSSIE_Msk                   (0x1UL << RCC_C2CIESETR_LSECSSIE_Pos)                  /*!< 0x00010000 */
#define RCC_C2CIESETR_LSECSSIE                       RCC_C2CIESETR_LSECSSIE_Msk                            /*!< LSE CSS interrupt enable */
#define RCC_C2CIESETR_WKUPIE_Pos                     (20U)
#define RCC_C2CIESETR_WKUPIE_Msk                     (0x1UL << RCC_C2CIESETR_WKUPIE_Pos)                    /*!< 0x00100000 */
#define RCC_C2CIESETR_WKUPIE                         RCC_C2CIESETR_WKUPIE_Msk                              /*!< CPU2 wake-up from CStop Interrupt Enable */

