STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp253axx_ca35.h
/*******************  Bit definition for WWDG_CFR register  *******************/
#define WWDG_CFR_W_Pos          (0U)
#define WWDG_CFR_W_Msk          (0x7FUL << WWDG_CFR_W_Pos)         /*!< 0x0000007F */
#define WWDG_CFR_W              WWDG_CFR_W_Msk                    /*!< 7-bit window value */
#define WWDG_CFR_W_0            (0x1UL << WWDG_CFR_W_Pos)          /*!< 0x00000001 */
#define WWDG_CFR_W_1            (0x2UL << WWDG_CFR_W_Pos)          /*!< 0x00000002 */
#define WWDG_CFR_W_2            (0x4UL << WWDG_CFR_W_Pos)          /*!< 0x00000004 */
#define WWDG_CFR_W_3            (0x8UL << WWDG_CFR_W_Pos)          /*!< 0x00000008 */
#define WWDG_CFR_W_4            (0x10UL << WWDG_CFR_W_Pos)         /*!< 0x00000010 */
#define WWDG_CFR_W_5            (0x20UL << WWDG_CFR_W_Pos)         /*!< 0x00000020 */
#define WWDG_CFR_W_6            (0x40UL << WWDG_CFR_W_Pos)         /*!< 0x00000040 */
#define WWDG_CFR_EWI_Pos        (9U)
#define WWDG_CFR_EWI_Msk        (0x1UL << WWDG_CFR_EWI_Pos)        /*!< 0x00000200 */
#define WWDG_CFR_EWI            WWDG_CFR_EWI_Msk                  /*!< Early wakeup interrupt */
#define WWDG_CFR_WDGTB_Pos      (11U)
#define WWDG_CFR_WDGTB_Msk      (0x7UL << WWDG_CFR_WDGTB_Pos)      /*!< 0x00003800 */
#define WWDG_CFR_WDGTB          WWDG_CFR_WDGTB_Msk                /*!< Timer base */
#define WWDG_CFR_WDGTB_0        (0x1UL << WWDG_CFR_WDGTB_Pos)    /*!< 0x00000800 */
#define WWDG_CFR_WDGTB_1        (0x2UL << WWDG_CFR_WDGTB_Pos)   /*!< 0x00001000 */
#define WWDG_CFR_WDGTB_2        (0x4UL << WWDG_CFR_WDGTB_Pos)   /*!< 0x00002000 */

/*******************  Bit definition for WWDG_SR register  ********************/
#define WWDG_SR_EWIF_Pos        (0U)
#define WWDG_SR_EWIF_Msk        (0x1UL << WWDG_SR_EWIF_Pos)        /*!< 0x00000001 */
#define WWDG_SR_EWIF            WWDG_SR_EWIF_Msk                  /*!< Early wakeup interrupt flag */

/*****************  Bit definition for WWDG_HWCFGR register  ******************/
#define WWDG_HWCFGR_PREDIV_Pos  (0U)
#define WWDG_HWCFGR_PREDIV_Msk  (0xFFFFUL << WWDG_HWCFGR_PREDIV_Pos) /*!< 0x0000FFFF */
#define WWDG_HWCFGR_PREDIV      WWDG_HWCFGR_PREDIV_Msk            /*!< The watchdog clock is prescaled by 4096 (PREDIV[15:0] + 1). */

/******************  Bit definition for WWDG_VERR register  *******************/
#define WWDG_VERR_MINREV_Pos    (0U)
#define WWDG_VERR_MINREV_Msk    (0xFUL << WWDG_VERR_MINREV_Pos)    /*!< 0x0000000F */
#define WWDG_VERR_MINREV        WWDG_VERR_MINREV_Msk              /*!< IP version minor revision info */
#define WWDG_VERR_MAJREV_Pos    (4U)
#define WWDG_VERR_MAJREV_Msk    (0xFUL << WWDG_VERR_MAJREV_Pos)    /*!< 0x000000F0 */
#define WWDG_VERR_MAJREV        WWDG_VERR_MAJREV_Msk              /*!< IP version major revision info */

/******************  Bit definition for WWDG_IPIDR register  ******************/
#define WWDG_IPIDR_ID_Pos       (0U)
#define WWDG_IPIDR_ID_Msk       (0xFFFFFFFFUL << WWDG_IPIDR_ID_Pos)/*!< 0xFFFFFFFF */
#define WWDG_IPIDR_ID           WWDG_IPIDR_ID_Msk                 /*!< WWDG peripheral identifier */

/******************  Bit definition for WWDG_SIDR register  *******************/
#define WWDG_SIDR_SID_Pos       (0U)
#define WWDG_SIDR_SID_Msk       (0xFFFFFFFFUL << WWDG_SIDR_SID_Pos)/*!< 0xFFFFFFFF */
#define WWDG_SIDR_SID           WWDG_SIDR_SID_Msk                 /*!< The address decoding range is 1 Kbyte */


/**
  * @}
  */

/**
  * @}
  */

/** @addtogroup Exported_macros
  * @{
  */

/******************************* ADC Instances ********************************/
#define IS_ADC_ALL_INSTANCE(INSTANCE) (((INSTANCE) == ADC1) ||                   \
                                       ((INSTANCE) == ADC2)  ||                   \
                                       ((INSTANCE) == ADC3))

#define IS_ADC_MULTIMODE_MASTER_INSTANCE(INSTANCE) ((INSTANCE) == ADC1)

#define IS_ADC_COMMON_INSTANCE(INSTANCE) (((INSTANCE) == ADC12_COMMON) ||         \
                                          ((INSTANCE) == ADC3_COMMON))

/******************************** BSEC Instances **********************************/
#define IS_BSEC_ALL_INSTANCE(INSTANCE)       ((INSTANCE) == BSEC)

/******************************* CRC Instances ********************************/
#define IS_CRC_ALL_INSTANCE(INSTANCE) (((INSTANCE) == CRC))

/******************************* CSI Instances *******************************/
#define IS_CSI_ALL_INSTANCE(INSTANCE) ((INSTANCE) == CSI)

/******************************* DCMI Instances *******************************/
#define IS_DCMI_ALL_INSTANCE(INSTANCE) ((INSTANCE) == DCMI)

/******************************* DCMIPP Instances *******************************/
#define IS_DCMIPP_ALL_INSTANCE(INSTANCE) ((INSTANCE) == DCMIPP)

/******************************** DMA Instances *******************************/
#define IS_DMA_ALL_INSTANCE(INSTANCE) (((INSTANCE) == HPDMA1_Channel0)  || \
                                       ((INSTANCE) == HPDMA1_Channel1)  || \
                                       ((INSTANCE) == HPDMA1_Channel2)  || \
                                       ((INSTANCE) == HPDMA1_Channel3)  || \
                                       ((INSTANCE) == HPDMA1_Channel4)  || \
                                       ((INSTANCE) == HPDMA1_Channel5)  || \
                                       ((INSTANCE) == HPDMA1_Channel6)  || \
                                       ((INSTANCE) == HPDMA1_Channel7)  || \
                                       ((INSTANCE) == HPDMA1_Channel8)  || \
                                       ((INSTANCE) == HPDMA1_Channel9)  || \
                                       ((INSTANCE) == HPDMA1_Channel10) || \
                                       ((INSTANCE) == HPDMA1_Channel11) || \
                                       ((INSTANCE) == HPDMA1_Channel12) || \
                                       ((INSTANCE) == HPDMA1_Channel13) || \
                                       ((INSTANCE) == HPDMA1_Channel14) || \
                                       ((INSTANCE) == HPDMA1_Channel15) || \
                                       ((INSTANCE) == HPDMA2_Channel0)  || \
                                       ((INSTANCE) == HPDMA2_Channel1)  || \
                                       ((INSTANCE) == HPDMA2_Channel2)  || \
                                       ((INSTANCE) == HPDMA2_Channel3)  || \
                                       ((INSTANCE) == HPDMA2_Channel4)  || \
                                       ((INSTANCE) == HPDMA2_Channel5)  || \
                                       ((INSTANCE) == HPDMA2_Channel6)  || \
                                       ((INSTANCE) == HPDMA2_Channel7)  || \
                                       ((INSTANCE) == HPDMA2_Channel8)  || \
                                       ((INSTANCE) == HPDMA2_Channel9)  || \
                                       ((INSTANCE) == HPDMA2_Channel10) || \
                                       ((INSTANCE) == HPDMA2_Channel11) || \
                                       ((INSTANCE) == HPDMA2_Channel12) || \
                                       ((INSTANCE) == HPDMA2_Channel13) || \
                                       ((INSTANCE) == HPDMA2_Channel14) || \
                                       ((INSTANCE) == HPDMA2_Channel15) || \
                                       ((INSTANCE) == HPDMA3_Channel0)  || \
                                       ((INSTANCE) == HPDMA3_Channel1)  || \
                                       ((INSTANCE) == HPDMA3_Channel2)  || \
                                       ((INSTANCE) == HPDMA3_Channel3)  || \
                                       ((INSTANCE) == HPDMA3_Channel4)  || \
                                       ((INSTANCE) == HPDMA3_Channel5)  || \
                                       ((INSTANCE) == HPDMA3_Channel6)  || \
                                       ((INSTANCE) == HPDMA3_Channel7)  || \
                                       ((INSTANCE) == HPDMA3_Channel8)  || \
                                       ((INSTANCE) == HPDMA3_Channel9)  || \
                                       ((INSTANCE) == HPDMA3_Channel10) || \
                                       ((INSTANCE) == HPDMA3_Channel11) || \
                                       ((INSTANCE) == HPDMA3_Channel12) || \
                                       ((INSTANCE) == HPDMA3_Channel13) || \
                                       ((INSTANCE) == HPDMA3_Channel14) || \
                                       ((INSTANCE) == HPDMA3_Channel15) || \
                                       ((INSTANCE) == LPDMA_Channel0)   || \
                                       ((INSTANCE) == LPDMA_Channel1)   || \
                                       ((INSTANCE) == LPDMA_Channel2)   || \
                                       ((INSTANCE) == LPDMA_Channel3))

#define IS_HPDMA_INSTANCE(INSTANCE) (((INSTANCE) == HPDMA1_Channel0)  || \
                                     ((INSTANCE) == HPDMA1_Channel1)  || \
                                     ((INSTANCE) == HPDMA1_Channel2)  || \
                                     ((INSTANCE) == HPDMA1_Channel3)  || \
                                     ((INSTANCE) == HPDMA1_Channel4)  || \
                                     ((INSTANCE) == HPDMA1_Channel5)  || \
                                     ((INSTANCE) == HPDMA1_Channel6)  || \
                                     ((INSTANCE) == HPDMA1_Channel7)  || \
                                     ((INSTANCE) == HPDMA1_Channel8)  || \
                                     ((INSTANCE) == HPDMA1_Channel9)  || \
                                     ((INSTANCE) == HPDMA1_Channel10) || \
                                     ((INSTANCE) == HPDMA1_Channel11) || \
                                     ((INSTANCE) == HPDMA1_Channel12) || \
                                     ((INSTANCE) == HPDMA1_Channel13) || \
                                     ((INSTANCE) == HPDMA1_Channel14) || \
                                     ((INSTANCE) == HPDMA1_Channel15) || \
                                     ((INSTANCE) == HPDMA2_Channel0)  || \
                                     ((INSTANCE) == HPDMA2_Channel1)  || \
                                     ((INSTANCE) == HPDMA2_Channel2)  || \
                                     ((INSTANCE) == HPDMA2_Channel3)  || \
                                     ((INSTANCE) == HPDMA2_Channel4)  || \
                                     ((INSTANCE) == HPDMA2_Channel5)  || \
                                     ((INSTANCE) == HPDMA2_Channel6)  || \
                                     ((INSTANCE) == HPDMA2_Channel7)  || \
                                     ((INSTANCE) == HPDMA2_Channel8)  || \
                                     ((INSTANCE) == HPDMA2_Channel9)  || \
                                     ((INSTANCE) == HPDMA2_Channel10) || \
                                     ((INSTANCE) == HPDMA2_Channel11) || \
                                     ((INSTANCE) == HPDMA2_Channel12) || \
                                     ((INSTANCE) == HPDMA2_Channel13) || \
                                     ((INSTANCE) == HPDMA2_Channel14) || \
                                     ((INSTANCE) == HPDMA2_Channel15) || \
                                     ((INSTANCE) == HPDMA3_Channel0)  || \
                                     ((INSTANCE) == HPDMA3_Channel1)  || \
                                     ((INSTANCE) == HPDMA3_Channel2)  || \
                                     ((INSTANCE) == HPDMA3_Channel3)  || \
                                     ((INSTANCE) == HPDMA3_Channel4)  || \
                                     ((INSTANCE) == HPDMA3_Channel5)  || \
                                     ((INSTANCE) == HPDMA3_Channel6)  || \
                                     ((INSTANCE) == HPDMA3_Channel7)  || \
                                     ((INSTANCE) == HPDMA3_Channel8)  || \
                                     ((INSTANCE) == HPDMA3_Channel9)  || \
                                     ((INSTANCE) == HPDMA3_Channel10) || \
                                     ((INSTANCE) == HPDMA3_Channel11) || \
                                     ((INSTANCE) == HPDMA3_Channel12) || \
                                     ((INSTANCE) == HPDMA3_Channel13) || \
                                     ((INSTANCE) == HPDMA3_Channel14) || \
                                     ((INSTANCE) == HPDMA3_Channel15))

#define IS_LPDMA_INSTANCE(INSTANCE) (((INSTANCE) == LPDMA_Channel0)   || \
                                     ((INSTANCE) == LPDMA_Channel1)   || \
                                     ((INSTANCE) == LPDMA_Channel2)   || \
                                     ((INSTANCE) == LPDMA_Channel3))

#define IS_DMA_2D_ADDRESSING_INSTANCE(INSTANCE) (((INSTANCE) == HPDMA1_Channel12)  || \
                                                 ((INSTANCE) == HPDMA1_Channel13)  || \
                                                 ((INSTANCE) == HPDMA1_Channel14)  || \
                                                 ((INSTANCE) == HPDMA1_Channel15)  || \
                                                 ((INSTANCE) == HPDMA2_Channel12)  || \
                                                 ((INSTANCE) == HPDMA2_Channel13)  || \
                                                 ((INSTANCE) == HPDMA2_Channel14)  || \
                                                 ((INSTANCE) == HPDMA2_Channel15)  || \
                                                 ((INSTANCE) == HPDMA3_Channel12)  || \
                                                 ((INSTANCE) == HPDMA3_Channel13)  || \
                                                 ((INSTANCE) == HPDMA3_Channel14)  || \
                                                 ((INSTANCE) == HPDMA3_Channel15))
#define IS_DMA_PFREQ_INSTANCE(INSTANCE) (((INSTANCE) == HPDMA1_Channel12)  || \
                                         ((INSTANCE) == HPDMA1_Channel13)  || \
                                         ((INSTANCE) == HPDMA1_Channel14)  || \
                                         ((INSTANCE) == HPDMA1_Channel15)  || \
                                         ((INSTANCE) == HPDMA2_Channel12)  || \
                                         ((INSTANCE) == HPDMA2_Channel13)  || \
                                         ((INSTANCE) == HPDMA2_Channel14)  || \
                                         ((INSTANCE) == HPDMA2_Channel15)  || \
                                         ((INSTANCE) == HPDMA3_Channel12)  || \
                                         ((INSTANCE) == HPDMA3_Channel13)  || \
                                         ((INSTANCE) == HPDMA3_Channel14)  || \
                                         ((INSTANCE) == HPDMA3_Channel15)  || \
                                         ((INSTANCE) == LPDMA_Channel0)    || \
                                         ((INSTANCE) == LPDMA_Channel1)    || \
                                         ((INSTANCE) == LPDMA_Channel2)    || \
                                         ((INSTANCE) == LPDMA_Channel3))

/******************************** EXTI Instances **********************************/
#define IS_EXTI_ALL_INSTANCE(INSTANCE)  ( ((INSTANCE) == EXTI1) || ((INSTANCE) == EXTI2))

